Tekla.Structures.Solid.VertexEnumerator
The VertexEnumerator class is used to enumerate the vertexes of a loop instance.

Tekla.Structures.Solid.VertexEnumerator.#ctor(System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Instantiates a new vertex enumerator.
Enumerator: The father loop's vertex list enumerator.

Tekla.Structures.Solid.VertexEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Solid.VertexEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Solid.VertexEnumerator.Current
Returns the current vertex.

Tekla.Structures.Solid.VertexEnumerator.System#Collections#IEnumerator#Current
Returns the current vertex.